{
  "八卦": {
    "000000": {
      "卦象": "坤卦",
      "卦辭": [
        "運氣：宜退守，可安然無事。妄動急進是自找麻煩。應該保持和順與平靜，不沉迷於利慾，違犯常規、常理則凶，謹守本分則吉，屬先苦後甘之象。\n婚姻運：可順暢，隨緣等待機會行事。\n求職運：暫不理想。\n健康運：病向淺中醫，不要忽略，以免變化成慢性病，注意飲食防腸胃炎。\n戀愛運：能成功，宜珍惜，不能意氣用事。"
      ]
    },
    "000001": {
      "卦象": "復卦",
      "卦辭": [
        "運氣：目前運程雖差，但不久就會變好。不能躁進，必須腳踏石地，按部就班在原有基礎上發展下去。目標不適宜訂得太高。\n婚姻運：不用急。有誠意就可得成功，成良緣。\n求職運：有恆心可求到一份滿意的工作，但不宜太性急。\n健康運：易患腸胃病或神經痛，可醫好無礙。\n戀愛運：有恆與誠的心可得成功。",
        "運氣：目前雖是衰運，但不久就有好運的來臨。然而現在仍不是挺身急進的時候，所以必須腳踏實地按步就班推展下去，不能期望過高，開始興辦某一件事是有利的。同時顯示阻礙的解通，願望或計劃成功的開端。失敗與損失的得到補償等象。\n婚姻：不用急，有恆地推進就可得到成功。是逐漸發展而得到幸福之良緣也。\n戀愛：性急即敗。以有恆與誠實待之即能得到成功。\n求職：沒有問題。不能性急。要有恆心就能成功。\n事業：屬吉，但要沉著漸進推行為宜。"
      ]
    },
    "000010": {
      "卦象": "師卦",
      "卦辭": [
        "運氣：運程變化大，起伏大。不要賣弄手段，應行正道，以堅強的毅力去面對逆境，排除萬難，會有意外的收穫，忌急於立功，我行我素易敗。事業和居住環境會有變化之象。\n婚姻運：感情還不穩定，不要急於結婚。\n求職運：沒有希望，等待時機。\n健康運：病了要及時治療，以免惡化，防心臟、及腹部疾病，要全身檢查身體。\n戀愛運：牽連太多，結果不成功。",
        "運氣：變動起伏大，多事多難之秋也。不要圖私利，或賣弄手段，應確守正道，拿出果斷的毅力處事，然後可以排除萬難，而得到意外之功名與利益。急於立功會失敗，我行我素即失敗之家。有業務上的變動，居住所在的變動或糾紛、盜難等之象。\n婚姻：毛病百出，不能稱為良緣也。\n戀愛：牽連太多，結果不成功。\n疾病：病勢變化無窮之嚴重象，然而由於治療得法，不致於絕望。所患為惡性腫瘤，心臟病或腹部等之疾病。\n求職：沒有希望。\n事業：為凶，宜三思為要。"
      ]
    },
    "000011": {
      "卦象": "臨卦",
      "卦辭": [
        "運氣：大運亨通。前程充滿了光明。宜搞好人際關係，不驕傲和得意忘形，否則影響運氣。\n婚姻運：可白頭到老之良緣。\n求職運：可達成希望。\n健康運：注意腸胃。拈花惹草可患性病或泌尿器病。\n戀愛運：成功可喜。",
        "運氣：運氣亨通萬事如意，前途充滿了光明與希望。然而不能因此而驕傲，得意忘形即易破壞大好之時運。社交上須處處留意待人溫和圓滿，不能輕浮失節。\n婚姻：百年和好之良緣也。\n戀愛：成功可喜之象。\n疾病：痊癒無疑，然而不可以太大意。所患當為腸胃病，性病或泌尿器病等。\n求職：達成希望之欣慰象也。\n事業：策劃可吉也。"
      ]
    },
    "000100": {
      "卦象": "謙卦",
      "卦辭": [
        "運氣：運氣平安，萬事如意，欣欣向榮。宜「謙」才能得人和，違反了謙遜之道易破壞而招致失敗。\n婚姻運：和好順利，得良緣。\n求職運：有機會，沒問題。\n健康運：防頭部、腹部疾病宜耐心療養可痊癒。\n戀愛運：成功愉快。",
        "運氣：氣運平安，萬事如意，欣欣向榮之時也。如果喪失謙讓之德性，驕傲橫行，違返了謙遜之道，即易破運而招致失敗與災害。不能不謹慎。\n婚姻：和好順利與幸福之良緣也。\n戀愛：成功可喜。\n疾病：耐心療養，即病況經過順利而漸達痊癒，所患疾病為腹部或頭部之疾病。還有舊病復發之象。\n求職：沒有問題。\n事業：進行可順，但不可性急無禮。"
      ]
    },
    "000101": {
      "卦象": "明夷卦",
      "卦辭": [
        "運氣：。運程呈昏暗狀態之象。多逆境，為此需注意言行，多退讓不要爭執，以待開運。這卦亦表示身體易受傷害或被欺。防火災，盜難。\n婚姻運：障礙多，不成功。\n求職運：暫時無望，等待一段時間。\n健康運：小心腹部疾患，不可大意，防小病變大病。\n戀愛運：障礙大不能成功。",
        "運氣：明夷卦光明受了損傷而呈昏暗狀態之象。所比是多艱難之非運也。當此應嚴謹您的言行，忍耐自重以等待時運之解通，同時是身體受傷害之象；被欺在災害不利；萬事阻滯，遇事迷惑；火災、盜難等象。\n婚姻：不成功。勞苦與障礙多乏凶緣也。\n戀愛：阻礙大，不成功。\n求職：暫時無望。等候一段時間。\n事業：屬凶，宜等待時機為宜。"
      ]
    },
    "000110": {
      "卦象": "升卦",
      "卦辭": [
        "運氣：如意，名利雙收。業務繁榮之時運。按部就班做事吉利，妄動必敗。能搞好人緣可增運，財運可順暢。\n婚姻運：前途燦爛之良緣。\n求職運：可達成願望。\n健康運：注意下腹部的毛病。治療一段時間會好。\n戀愛運：可有好對象，但不要太急躁。",
        "運氣：如意，名利雙收。業務繁榮之時運。按部就班做事吉利，妄動必敗。能搞好人緣可增運，財運可順暢。\n婚姻運：前途燦爛之良緣。\n求職運：可達成願望。\n健康運：注意下腹部的毛病。治療一段時間會好。\n戀愛運：可有好對象，但不要太急躁。"
      ]
    },
    "000111": {
      "卦象": "泰卦",
      "卦辭": [
        "運氣：吉祥安泰，萬事如意，家有喜事，前景好，事業發展繁榮。切記不能因好運而驕傲或過份鬆懈與怠慢，否則破運。\n婚姻運：屬良緣。\n求職運：順利可喜。\n健康運：注意調理身體無礙。易有腸胃病及易感冒，或有暗病。\n戀愛運：溫馨，專情則吉。",
        "運氣：吉祥安泰，萬事如意。尤其本身或家庭內均有喜事，前途發展與業務繁榮。然而不能因走紅運而驕傲或過份鬆懈與怠慢，否則有破運之慮。\n婚姻：和好幸福之良緣，一切順利。\n戀愛：情投意合之象。但太大意即容易破壞。\n疾病：病情的發展經過順利，不久可痊癒。但須留心養病，否則失敗。所患疾病為消化器病，性病或感冒等。\n求職：順利可喜。\n事業：可策劃推進，屬吉之象。"
      ]
    },
    "001000": {
      "卦象": "豫卦",
      "卦辭": [
        "運氣：萬事如意，喜氣洋溢之安泰象。然而不能因安樂而怠慢，流連歡樂場所，若不努力，保持盛運之持續，就會招致繼續運轉向壞方面，宜按部就班不躁急，整理每日的事物及文件。\n婚姻運：屬良緣，可以順利撮合。\n求職運：可得上司的提拔而上進。\n健康運：密切留意療養，可望痊癒。\n戀愛運：可成功不用擔心，若固執就不好，會疏離。",
        "運氣：萬事如意，喜氣洋溢之安泰象。然而不能因安樂而怠慢，流連歡樂場所，若不努力，保持盛運之持續，就會招致繼續運轉向壞方面，宜按部就班不躁急，整理每日的事物及文件。\n婚姻運：屬良緣，可以順利撮合。\n求職運：可得上司的提拔而上進。\n健康運：密切留意療養，可望痊癒。\n戀愛運：可成功不用擔心，若固執就不好，會疏離。"
      ]
    },
    "001001": {
      "卦象": "震卦",
      "卦辭": [
        "運氣：宜奮發將惡運轉化趨向光明。謹慎處事，多充實自己，多佈施，收歛自己，不要太過自尊，放開懷抱有創見才能獲得成功。\n婚姻運：初有障礙，能解決問題，可成全良緣。\n求職運：費時而不得要領，在等待吧。\n健康運：有病者會惡化，需要靜養才得安康。注意肺部、動脈硬化症或腦部。\n戀愛運：雖有風波與障礙，誠心必能成功。",
        "運氣：雖是多事多難之秋，然有扭轉惡運趨向光明之勢。宜謹慎處事，按步推展，克服一切困難就能達成目的，獲得盛運。同時繼承他業可獲名利雙收之效。學藝兼備，為國效勞。揚眉吐氣，聲勢強大，獲得眾人信服與擁戴之象；勇敢果斷；繼承父志，發揚光大之象。另一方面及可能因自尊心過強，不聽他人的好言相勸，以致於招致失敗，或因短見與衝動引起不利與失敗等。\n婚姻：最初有阻礙，但畢竟能排除困難，成全其美之良緣也。\n戀愛：雖有波瀾與阻礙，但終能成功。\n疾病：病況起伏不定，但留心療養當可痊癒。所患為神經痛，腦病或急性的內臟疾病等。\n求職：有困難。但努力以克服及可達成目的。\n事業：均可策劃推行。然不可操之過急或過份勉強。"
      ]
    },
    "001010": {
      "卦象": "解卦",
      "卦辭": [
        "運氣：經過長久之艱辛萬苦，開運了。應把握時機，不要見異思遷，保持沉著應戰，向西南方推進吉利。依賴屬下智囊團的助力可成功。有喜慶之兆。\n婚姻運：屬良緣，可放心。\n求職運：能得愉快收獲，但須把握機會。\n健康運：注意神經系統衰弱，腸胃病無礙。\n戀愛運：不能猶豫不決。挺身去坦白有好結果。",
        "運氣：經過良久的艱辛萬苦，開始解運而邁向順利之大道。應把握良機，攫取名初；不能移心他處或衝動，保持沉著迎戰，向西南方推進即吉利，依賴屬下智囊團的助力而成功，有生產或家內有喜事之吉兆也。\n婚姻：可獲成功之良緣。\n戀愛：不能猶豫不決，應挺身而出以獲取成功之果。\n疾病：康復可賀也。但不能太大意。必須爭取時效治療之。所患為神經衰弱或腸胃病等。\n求職：能得到意外的收穫。但必須把握機會。\n事業：把握時機，趁早進行。"
      ]
    },
    "001011": {
      "卦象": "歸妹卦",
      "卦辭": [
        "運氣：為沉迷於情慾，違反常理，失正道之時運。目前暫似吉運，但不久會有問題出現。辦事要注意能貫徹始終，半途而廢則壞。\n婚姻運：不合，會分手。\n求職運：尚未找到工作。\n健康運：要注意飲食衛生，這是病因，消化器官疾病。注意胸部、性病及腦病。",
        "運氣：表示沉於情慾違反常理，喪失正道之時運也。目前似吉運，但不久禍害災害必至，而陷於痛苦與不幸之深淵。還有不能貫徹始終之象；夫妻失和；發生糾紛等象。\n婚姻：不幸之凶緣也。最好罷手。好像快要成功，其實恰好相反，終歸失敗。\n戀愛：孽緣也。雖然得到一時的成功。但最後仍以悲劇收場。\n疾病：暫時顯得康復不少。不過再度因不注重衛生與保養而惡化就陷於絕望。所患為消化器病，胸部的疾病，性病或腦病等。\n求職：最初好像很順利，其實得不到結果的。\n事業：凶，暫停為宜。"
      ]
    },
    "001100": {
      "卦象": "小過卦",
      "卦辭": [
        "運氣：萬是因過急而敗。謹守份內事，崗位則安。著手於份外的工作，往往功敗垂成。退守吉，急進敗，不得人和，易引起糾紛。忌為人出頭或擔保。\n婚姻運：互相體諒，多看優點，不可輕易變化。\n求職運：暫時在原有的地方繼續做，以後再考慮。\n健康運：病情會好轉，要繼續求醫治療，所患的為糖尿病，胸部病。\n戀愛運：未成熟不穩定，會有變化的可能。",
        "運氣：萬事過於急進而招致失敗與不利，必須翻守崗位做份內的事，著手於份外的工作即導致失敗與不利。退守吉，急進凶。不得人和而引起糾紛之象。與自己的近親或親信人物考別離之象。受他人委託辦理的事情變成他日禍端的原因之象等。\n婚姻：不和與別離之凶緣也，須重加考慮。\n戀愛：可能有暫時的成功。但持續不了。尤其對方可能變心。\n疾病：病況一度好轉，但以後更惡化而危險。然而用心治療即非絕望也。所患為喝病，胸部的疾病等。\n求職：無望。暫時找一棲身之所。以後在等待時機轉移陣地。\n事業：凶，暫時停止策劃，宜等待時機為安。"
      ]
    },
    "001101": {
      "卦象": "豐卦",
      "卦辭": [
        "運氣：財運亨通，前程一片光明，萬事主強富有生機。記住，不要得意忘形，一鬆懈怠慢、停步就轉衰。運氣之盛衰是自然循環必然道理。要保持努力。\n婚姻運：吉緣。\n求職運：有意想不到的好職業，宜熱愛工作。\n健康運：先天身體強健，有病能即時醫，可安。\n戀愛運：成功無疑，不珍惜或我行我素會轉壞，不能不慎。",
        "運氣：氣運亨通，萬事呈強而富於生機，得意滿滿之時運也。然而因此而得意忘形，鬆懈怠慢及導致破運。運氣的盛衰是自然循環的必然道理。吾人必須加強努力以確保盛運之持久性。同時有賺錢運之象。但切忌奢侈浮華。以免破壞宏運。與他人共是可也。並且也顯示人事處理不當，或受騙之災害與不利與火災等象。\n婚姻：繁榮之吉緣也。\n戀愛：成功無疑。然切忌彼此我行我素及導致破運。不能不慎。\n疾病：病況相當嚴重，然而素來身體強健。所以只要用心療養勢必獲得痊癒無疑。所患為喝病，腸胃病或神經系統的疾病等。\n求職：得到意想不到的好職位。然就職後，往往得意忘形以致於怠慢就導致破運。\n事業：可策劃進行，吉也。"
      ]
    },
    "001110": {
      "卦象": "恆卦",
      "卦辭": [
        "運氣：謹守岡位，不妄動可得安泰，與長久的繁榮。\n婚姻運：順利。\n求職運：會得一份是合自己的工作。\n健康運：治療可痊癒，屬慢性病及屬先天潛在身的宿病。\n戀愛運：長久合好之良緣，可結婚。",
        "運氣：正心誠意，謹守崗位，不可輕舉妄動即得安泰與長久的繁榮。同時又是顯示諸事平安象，但嘗試新企圖即凶。\n戀愛：長久和好之良緣也。順利撮合之象。\n疾病：治療費時，但可痊癒。所患為慢性病或宿疾。\n求職：適得其位之吉象。\n事業：不可以。維持現狀可也。"
      ]
    },
    "001111": {
      "卦象": "大壯卦",
      "卦辭": [
        "運氣：運勝期，切忌輕舉妄動，嚴守正道虛心。\n婚姻運：夫妻之間須彼此關懷，和順尊敬。\n求職運：和氣生財，注意態度及禮貌。\n健康運：小心急性肺炎及腦部，及時治療可痊癒。\n戀愛運：可成功，多禮讓可溫馨。",
        "運氣：時當盛運，切忌輕舉妄動。否則有破運之虞。必須嚴守正道，確保盛運為迫切之需。還有處事缺和氣，易衝動而招致失敗災害。不能容忍而得罪他人，以致於招來失敗與災害等象。您必須虛心待人待事最為重要。\n婚姻：能成功之象。但不可衝動，將來必得繁榮幸福之良緣也。夫妻之間必須彼此和順禮待以免導致破運。\n戀愛：成功。切忌彼此缺乏稍讓以致於破壞家庭幸福。\n疾病：病況看去似乎沒有好轉，但因素來體格健壯，只要療養得法，必可得痊癒。所患為急性肺炎，腦病等。\n求職：沒有問題。但缺乏和氣即永遠不得逞。\n事業：可策劃進行，但切勿勉強行事。"
      ]
    },
    "010000": {
      "卦象": "比卦",
      "卦辭": [
        "運氣：平安吉祥，融洽。避免橫行、傲氣、爭強，否則敗。卦象顯示與人合作，遵照上司或長輩意見行事吉。\n婚姻運：和好，屬良緣。\n求職運：有人提拔，可獲得好職位。\n健康運：不久可健康，病向淺中醫。\n戀愛運：彼此相愛，可訂下良緣。",
        "運氣：平安吉祥之象也。與他人相親相處，避免橫行無忌或過份激烈的行為，否則就破壞了大好之吉運。與他人共事者吉，遵照上司的意見行事者吉象。同時又是得眾望而有所發展之吉象也。\n婚姻：和好大吉之良緣也。\n戀愛：彼此相思而必然成功之吉象。\n疾病：不久可以痊癒。但不能延誤時效。\n求職：有人提拔能獲得前途有望的職位。\n事業：近可以攻之吉象也。"
      ]
    },
    "010001": {
      "卦象": "屯卦",
      "卦辭": [
        "運氣：萌芽期，需要陽光與水份、空氣，卦象顯示創業初期需要經歷艱苦，投入事業裏能埋頭苦幹，必能成功。\n婚姻運：好事多磨，考驗過後可安樂。\n求職運：能求得貴人之助力，易得職位。\n健康運：注意五官之耳、鼻毛病，還有心臟及腎臟，耐心治療會逐漸好轉。\n戀愛運：專心與真誠可獲成功。",
        "運氣：開始創業，多事多難之象也。不能輕舉妄動，要有堅忍奮鬥的意志，埋頭苦幹，即能逐步解除萬難，大功告成。防洪水災難，致家務飄搖之象。遵照上司的指示或追隨賢達明德之士，即有良好表現。\n婚姻：好事多磨，要有耐心，終究能得到良緣也。\n戀愛：中途諸多障礙，要有耐心，同時以誠待之就有成功希望。\n疾病：病勢變化無窮而嚴重，時間拖延長，但有逐漸痊癒之希望。所患應屬於耳鼻，心臟，腎臟或神經病等。\n求職：障礙多，耽誤時間也長。依賴長輩們的各種關係耐心地去應徵必有收穫。\n事業：障礙多而很難順，宜待機行事較好。"
      ]
    },
    "010010": {
      "卦象": "坎卦",
      "卦辭": [
        "運氣：卦象顯示，凡事宜適中，太過則壞，易陷入困局。宜發揮自己的智慧在困局中創新，多挑戰自己，就會在逆運中取得樂趣。\n婚姻運：障礙多，要彼此間共同努力，忍讓諒解，畢竟是良緣。\n求職運：暫時無適合自己，等待一個時期。\n健康運：小心脊髓的毛病，或肺部，不可忽略。\n戀愛運：要靠雙方努力。",
        "運氣：卦象顯示，凡事宜適中，太過則壞，易陷入困局。宜發揮自己的智慧在困局中創新，多挑戰自己，就會在逆運中取得樂趣。\n婚姻運：障礙多，要彼此間共同努力，忍讓諒解，畢竟是良緣。\n求職運：暫時無適合自己，等待一個時期。\n健康運：小心脊髓的毛病，或肺部，不可忽略。\n戀愛運：要靠雙方努力。"
      ]
    },
    "010011": {
      "卦象": "節卦",
      "卦辭": [
        "運氣：占得此卦顯示處事必須有適當的節制或分寸。也就是取中庸之道。切勿橫衝直撞，否則易招災害，陷於痛苦不能自拔。也須抱有災害時而能處之泰然。\n婚姻運：吉利，不用擔心，耐心進行可成功。\n求職運：欠缺機會。難求到。\n健康運：注意消化系統，神經痛，可安康。\n戀愛運：正在戀愛者彼此間要互相關懷。未有對象者，眼光不要太高。",
        "運氣：占得此卦顯示處事必須有適當的節制或分寸。也就是取中庸之道。切勿橫衝直撞，否則易招災害，陷於痛苦不能自拔。也須抱有災害時而能處之泰然。\n婚姻運：吉利，不用擔心，耐心進行可成功。\n求職運：欠缺機會。難求到。\n健康運：注意消化系統，神經痛，可安康。\n戀愛運：正在戀愛者彼此間要互相關懷。未有對象者，眼光不要太高"
      ]
    },
    "010100": {
      "卦象": "蹇卦",
      "卦辭": [
        "運氣：運氣處於閉塞不通期，困難重重。進退兩難。以守為主，容忍等待時運。宜跟才德兼備的長輩共進退。交友小心，防交上損友。\n婚姻運：不成功，多障礙。\n求職運：暫時不利，全權委託長輩幫忙。\n健康運：注意腎臟、肝及腹膜，病情不輕，求名醫診治，接受治療可安康。\n戀愛運：較反覆，需靠雙方努力。",
        "運氣：氣運閉塞不通，艱難困苦重重，進退維谷之時運也。此時應確守正道，容忍自重以等待時運之解通。宜跟隨才德兼備的長輩同進退，向西南方推進可也。向東北方推進即凶。第五個月後獲第五年後開始轉運。同時還有被她人奸計陷害，心腹判離，權勢分裂，治理事物不得頭緒等象。\n婚姻：不成功。同時是多勞苦，多阻礙之凶緣也。\n戀愛：失敗。\n疾病：嚴重危險，用心治療即可康復。接受治療得到痊癒之象。所患為腎臟、肝臟，腹膜或胸部等疾病。\n求職：暫時無望。全權姿託長輩等待就是。\n事業：凶，宜等待時機。"
      ]
    },
    "010101": {
      "卦象": "既濟卦",
      "卦辭": [
        "運氣：功名與利益雙收為盛運之象。盛運時期要防驕傲、怠慢。堅忍自重，才能確保盛運之持續。\n婚姻運：相配稱的婚姻才可和好。\n求職運：可能會得臨時性的職位，但不穩定。\n健康運：健康康復之後仍然要注意，會有復發的可能。\n戀愛運：會有一時的成功，隨緣。",
        "運氣：功名與利益雙收，氣運安泰隆盛之時也。盛運之極，必隱藏著傾衰之預兆。所以不能驕傲與怠慢，堅忍自重以確保盛運之持續為切身之需。同時上有初吉而末亂及別離分散之象。退守吉，急進凶。往往一時順利而再度破運之象。須安份守己，不能做大志大望的妄想，又有與親信者的不和等象。\n婚姻：最初順利和好，但終究變為凶緣也。也可能是一旦成功之後，又解除婚約。\n戀愛：能有一時的成功，但並不長久。終究歸於失敗。\n疾病：雖有一時的康復，但有再發作之虞。不能不留意而做徹底的療養以期痊癒為止。所患為心肺病，腹部的疾病或老人病等。\n求職：可能有臨時性的職位或功敗垂成之象。\n事業：順利，但防好景不常。"
      ]
    },
    "010110": {
      "卦象": "井卦",
      "卦辭": [
        "運氣：卦象顯示宜發揮才能為人群造福，不宜過於消極，運氣屬平淡，為此在振奮中又要注意勿妄動。若能得長輩之助事業可得到很大發展。\n婚姻運：不宜操之過急結婚，感情穩定了，隨時可成婚。\n求職運：暫不要性急，委託長輩代為安排，成功無疑。\n健康運：注意感冒病毒，及泌尿疾病，需求醫。\n戀愛運：操之過急易有衝突，順其自然可輕鬆自在、溫馨。",
        "運氣：井，得到人的使用才能發揮它的用途。雖然它對人群造福不少，但過於消極。所以占到此卦即表示氣運平靜，宜避免積極的方針，勿妄動，確守本份以確保平安無事。代表功敗垂成之象；等待時日即可得到長輩的援助，而萬事如意進展之吉象等。\n婚姻：平安之良緣也。操之過急即失敗。誠懇，耐心與努力是成功的必要條件。\n戀愛：操之過急必遭失敗。聽其自然。\n疾病：耐心療養必得痊癒。所患為泌尿器病，身體下半身的疾病或感冒等。\n求職：暫時不要性急。委託長輩代為尋找即能成功無聚。\n事業：最好是維持現狀。"
      ]
    },
    "010111": {
      "卦象": "需卦",
      "卦辭": [
        "運氣：此卦表示未到時機，切記勿急變，否則陷於困境。不宜貪眼前的小利。\n婚姻運：不要太早決定，中途會有障礙考驗。努力會得好結果。\n求職運：無法求得好職業，需再等。\n健康運：療養得當可健康，腸胃病及血液方面的毛病需留意。\n戀愛運：性急即敗，忍耐、誠實待之吉。",
        "運氣：遵守正道，堅忍自重，不能過份急進與妄動，等待有利時機的到來即運氣逐漸轉佳，終究能完成大志大業之雄心抱負。小貪目前的小利即必然招致失敗。此為雄才大略待機行事之象。過份急進即可能遇到艱難與危險。\n婚姻：起初不得要領，徒勞而無功。但畢竟能有好結果。中途勢必發生阻礙或煩惱。只要有恆心，一直努力下去必有好結果。\n戀愛：性急即敗。須忍耐接觸與誠實待之，必有收穫。\n疾病：病的時間長，只要療養得當必可痊癒。所患為腸胃病，腦病或有關血液的疾病等。\n求職：無法立刻找到職業，耐心等候就有良好職位。\n事業：不得其時，唯有暫等時機。"
      ]
    },
    "011000": {
      "卦象": "萃卦",
      "卦辭": [
        "運氣：心情愉快、得人和，賺大錢之時運。表示上下樂融融相處之吉祥。順從長輩的意思即可開運與吉利。財運亨通易得貴人助，利農作物，可豐收。\n婚姻運：和好幸福之吉緣。可如意。\n求職運：順利可賀。\n健康運：重視胸部與腹部毛病。\n戀愛運：相敬如賓之成功象。",
        "運氣：表示聚合豐盛之象。得人和，而賺大錢之時運也。還有上下樂融融相處之吉祥，順從長輩的意思即得開運與吉利。得神明與祖先的庇佑；金錢運亨通；農作物豐收等象。\n婚姻：和好幸福之吉緣也。成功無疑。\n戀愛：相敬如賓之成功象。\n疾病：很快就可痊癒。所患當為胸部或腹部之症病。\n求職：順利可賀也。\n事業：可策劃進行。"
      ]
    },
    "011001": {
      "卦象": "隨卦",
      "卦辭": [
        "運氣：不要隨波逐流。宜專心於某一種事業。\n婚姻運：經愛情長跑後成婚，婚後需坦誠相對，珍惜。\n求職運：有長者提攜即順利。\n健康運：屬慢性病，要注重療養，消化系統及生殖系統病。\n戀愛運：會成功。若沉溺於情慾而缺乏關懷，即會影響感情。",
        "運氣：尊重他人的意見，不能專橫即萬事如意而名利雙收之吉祥運也。迫切需要摒棄一切邪惡壓迫而就正義之象。借助於他人的力量即可成全大事大業。最好專心於某一種事業，不要分神於他處。\n婚姻：可能拉長時間，但最後是成功。然而婚後必須嚴守夫婦之道，否則必招致勞碌不幸之惡果。\n戀愛：成功無疑，但僅沉溺於情慾的滿足即有感情破裂之慮。\n疾病：可能患病時間長，但必然痊癒。不過要切守療養之道，否則必招不幸。所患當為性病，消化器病等。\n求職：有長者提攜即順利。\n事業：要有充分的計畫，不能性急，則吉。"
      ]
    },
    "011010": {
      "卦象": "困卦",
      "卦辭": [
        "運氣：先苦後甘，逆境早來可早安樂。急進凶退守吉，助力少凡事只能親力親為。做人、做事要守信用。應堅忍自重走正路。\n婚姻運：隨緣而行。\n求職運：暫時難遇到，不心急，再留意。\n健康運：平時注意鍛鍊身體，增強體質，注意心臟或肺及下腹疾病。\n戀愛運：失敗是成功之母。",
        "運氣：先苦後甘，逆境早來可早安樂。急進凶退守吉，助力少凡事只能親力親為。做人、做事要守信用。應堅忍自重走正路。\n婚姻運：隨緣而行。\n求職運：暫時難遇到，不心急，再留意。\n健康運：平時注意鍛鍊身體，增強體質，注意心臟或肺及下腹疾病。\n戀愛運：失敗是成功之母。"
      ]
    },
    "011011": {
      "卦象": "兌卦",
      "卦辭": [
        "運氣：吉運，一切如意，與他人和睦相處者吉。有喜事；防在中途發生挫折。小心言語講得太多而招來禍端。\n婚姻運：和好之良緣，然而夫妻間如太自我，互不相讓，就會影響感情。\n求職運：請有力的人士幫忙。需要長少少的時間，但可獲得結果。\n健康運：注意飲食衛生。\n戀愛運：可能成功，但若我行我素，背道而馳就會失去良緣。"
      ]
    },
    "011100": {
      "卦象": "咸卦",
      "卦辭": [
        "運氣：萬事如意吉祥。與他人合作利。但有不明是非之問題出現，小心情色糾紛，防錯交朋友而誤入歧途等。\n婚姻運：吉，順利之良緣。\n求職運：一切順利，可求得一份職業。\n健康運：注意衛生，注意生殖器官之疾病及胸部病。\n戀愛運：相敬如賓之一對。然不能太透支你的情感，否則必敗。",
        "運氣：萬事如意之吉祥運也。然而意亂情迷，過於衝動即導致破運。並且有不明是非之失敗災害；色情糾紛或偏私引起的災害與不利；錯交朋友而誤入歧途等象。男女相愛即吉；與他人共事者吉等象。\n婚姻：順利之良緣也。\n戀愛：相敬如賓之一對也。當可成功無疑。然不能太透支您的情感。否則必敗。\n疾病：療養得法必得痊癒。所患為性病，胸部的疾病等。\n求職：順利。\n事業：可策劃推行。"
      ]
    },
    "011101": {
      "卦象": "革卦",
      "卦辭": [
        "運氣：宜變革，氣運變化，宜發揮自己的潛質與智慧絕斷地革新。\n婚姻運：隨緣，不宜太煩惱。\n求職運：所期待的職業不適宜了，另外謀出路即可成功。\n健康運：治療上不可鬆懈，用心治療可痊癒，心臟及眼部疾病與下腹疾病要特別留意。\n戀愛運：付出真心，積極進行即可獲成功。",
        "運氣：氣勢變化無窮之時運也，本身業務上，或其他事物均有所變動。處於這種境遇您不能猶豫不決，拿出您的魄力與明智的斷絕革新為迫切之需。如此一來即氣運一新，而前途露出一道曙光。須確守正道最重要。一方面有住所或可能發生糾紛等象。\n婚姻：當前所提者不要考慮了。唯有另找對象進行之。\n戀愛：以勇敢，果斷，積極進行即可獲成功。\n疾病：病況變化無窮，治療上不可鬆懈，用心治療當可痊癒。同時還有變更醫師或治療的方法以得良好效果之象。所患為心臟病，眼睛的疾病與下腹部的疾病等。\n求職：目前期待的職位沒有希望。改變方針另謀出路即可獲成功。\n事業：積極展開即吉也。"
      ]
    },
    "011110": {
      "卦象": "大過卦",
      "卦辭": [
        "運氣：應該迎合時機，量力改變適當的方針（方法）。心要定，不宜見異思遷。太大的投資或創意不適宜，負擔過重，力不從心，不但不能完成事業而且會被困。\n婚姻運：謹慎處理，彼此要互相了解。\n求職運：困難多端，量力謀求，不要灰心。\n健康運：注意並向淺中醫，避免過勞和劇烈運動，脊髓和肺部是毛病所在。\n戀愛運：要求太過份，志趣不合。",
        "運氣：表示所擔負之責任過重，力不從心，不能完成大事大業，遭遇挫折而將墮落之時運。所以此時應該迎合時機，量力改變適當方針，採取轉運安泰之計為迫切之需。同時此卦還代表著輕舉妄動而，招致失敗與災害，身心漂浮不定，糾紛，發生在文書上的錯誤與水災等象。\n婚姻：不相稱。無法撮合。假定已結了婚就表是感情不合或生離死別之凶緣也。\n戀愛：沒有成功的希望。\n疾病：嚴重。如盡最大的努力以療養即非絕望也。所患為脊髓的疾病或肺病等。\n求職：困難多端，然埋頭用功即有良好之成績表現。\n事業：量力而為，可也。"
      ]
    },
    "011111": {
      "卦象": "夬卦",
      "卦辭": [
        "運氣：雖然正在行好運，逆運亦會隨時來，切忌輕舉妄動。應謹慎自重。處理文件契約，文書要留心避免出錯招損失。\n婚姻運：屢見障礙，問題已清楚，部是好的緣份。\n求職運：有困難，認真努力才有希望。\n健康運：先天體質強，可能需要動手術來治療。頭部、腎臟及腹膜炎。\n戀愛運：不成功。",
        "運氣：雖然正是走紅運，然困難與危險迫近眉睫。切忌輕舉妄動，應謹慎自重，確守正道為迫切之需。同時顯示與人爭執即招致災害與不利，處理文書契約的不當導致災害與損失；水難；住址的更動；排除奸惡而得安泰之象等。\n婚姻：不成功。屢見阻礙，顯露破綻凶緣也。\n戀愛：不相稱。不成功或以悲劇收場。\n疾病：病況嚴重與危險。然而先天的體質強健，因此可動手術或特殊的治療法以挽救之。治療上須有決斷。所患為頭部的疾病，胃臟病，腹膜炎或惡性腫瘤等。\n求職：困難。然真誠努力仍有希望。\n事業：再加考慮吧！如因情況的需要不得不外出，就得相當小心。"
      ]
    },
    "100000": {
      "卦象": "剝卦",
      "卦辭": [
        "運氣：宜謹慎、退守為急需之方計。以等開運才作進一步的改革。小心捲入桃色糾紛，部屬牽連，不適宜為人作擔保，投資要有計劃。\n婚姻運：多勞苦，會有生離或死別之凶象，不考慮為上策。\n求職運：運氣比別人差，時機未到等下次，不用灰心。\n健康運：頭部疾病煩惱。腹膜炎或肺部亦不能忽視，及時求醫。\n戀愛運：被拒於外，隨緣好。",
        "運氣：窮困潦倒衰亡之時運，宜謹慎退守，為急需之方針，以等待時運之解通。並且可能捲入桃色糾紛的漩渦，被惡人陷害及部屬的牽連，致散才損失或本身的不得志等。\n婚姻：多勞苦，非生離就是死別之凶緣也。停止接觸為上計。\n戀愛：被拒於外或悲劇收場。\n疾病：病危。沒有康復希望。所患為頭部的疾病，嚴重的性病，腹膜炎或肺病等。\n求職：暫時無望要等待。\n事業：屬凶，若勉強進行，將招致災害。"
      ]
    },
    "100001": {
      "卦象": "頤卦",
      "卦辭": [
        "運氣：要善於把握機會，善於觀察新事物識時務，走正道，才能保持好運氣。若粗心妄動，不注意身體的保健，言語不慎，與人爭執，影響運氣大而且易招損。\n婚姻運：須多關心對方的健康，成敗出自於自己的努力有幾分。\n求職運：不可能立刻謀就。\n健康運：飲食衛生最重要，若染到病菌後果嚴重，防腸胃病、喉、呼吸系統。\n戀愛運：部要貪慕虛榮。",
        "運氣：察時運，識時務確守正道，以為運氣安泰之計為迫切之需。如粗心妄動，即破運而招致不利與災害，陷於勞苦之深淵。還有不注重身體的保健而引起病難。言行不慎而招災，與人爭執即不利，被部屬牽累。與人共事即有成就等象。\n婚姻：須將對方的健康問題重作一番詳細調查的必娶。然後進行商談。成敗繫於彼此的誠意與努力。\n戀愛：意亂情迷，錯估對象過高之象。您必須冷靜下來，以理智重新把對方加以估計。\n疾病：療養不得法而陷於絕望之象。須謹慎治療與保養，才能確保生命的安全與健康。尤其應特別留意飲食方面。所患為腸胃病，嘴或咽喉等疾病。\n求職：不可能立刻謀就。須等待時機。\n事業：不得時，宜待機行事為妙。"
      ]
    },
    "100010": {
      "卦象": "蒙卦",
      "卦辭": [
        "運氣：氣運澀滯，艱難困苦，不明事理。缺乏果斷，處事猶豫不決而誤事。應採納長輩的意見，指示。不宜用詭計或不正的途徑貪取私利。財務方面要小心處理不當或文件出錯會蒙受損失。\n婚姻運：緣分在遠處，這樁婚事的好壞為，最初較辛苦，苦盡甘來。\n求職運：未能及時得到職位，需再等待。\n健康運：要進一步查明病因，不要再拖延，要與醫生配合，多養心調身。病因可能在腦部及下腹部位。\n戀愛運：因缺乏勇氣和決斷而失敗。",
        "運氣：氣運澀滯，艱難困苦，並且不明事理，缺乏果斷，處事猶豫不決而往往誤事。應該遵照長輩的指示，虛心接受他們的教導，耐心自重以等待氣運逐漸解通，就有光明前途的來臨，不能賣弄詭計與手段，應確守至誠篤實待人。社交上您如果處處抱有疑心即不利，雖抱有整頓事物的雄心然在實行上發生了阻礙。也可能由於支票或有關文書、證件等的錯誤或處理不當，而蒙受災難與損失。\n婚姻：成功的機會渺茫，只得暫時等待。致於這樁婚事的好壞可斷定為最初較吃苦，以後就比較順利之吉象也。同時本卦表示緣份在遠處之象。\n戀愛：因缺乏勇氣與決斷之失敗之象。\n疾病：病源不明，拖延很長時間。痊癒與否完全依賴您的養生方法來決定。所患疾病當為肺病、腹部的疾病或傳染病等。\n求職：不可能立刻就謀得職業，須耐心的等待與努力。\n事業：不得時，須等待時機。"
      ]
    },
    "100011": {
      "卦象": "損卦",
      "卦辭": [
        "運氣：氣運衰微，萬事不如意之時運。誠懇才可逐漸喚回局勢。在失敗中有曙光，不用灰心。只要肯努力，逆境時一樣可創出好成績，利與人合作可得貴人幫助。\n婚姻運：最初難免發生百般阻撓，但畢竟是良緣。成功與否靠熱忱。\n求職運：暫不能得理想工作，繼續去留意。\n健康運：病勢嚴重，療養得法，可痊癒，身體主要是貧血，身心衰弱，消化器官疾病。\n戀愛運：誠心誠意貫徹始終可獲成功。",
        "運氣：氣運衰微，萬事不如意之時運也。誠懇努力都可逐漸挽回局勢。同時也有失敗損失後，挽回而得吉利之象。凡事不能立刻成功，但隱約中漸有成功曙光。與人共事即吉利，有得神佛的保佑之緣。\n婚姻：最初難免發生百般阻撓，但畢竟是良緣，成功與否全靠熱誠與努力。\n戀愛：誠心誠意，貫徹始終，可獲成功。\n疾病：病勢嚴重，然因療養得法，可得痊癒無疑。所患為貧血，身心衰弱，消化器病等。\n求職：暫時無法獲得理想結某，但熱誠奔跑，可獲成功也。\n事業：不能性急或太勉強，順其自然推進才會吉。"
      ]
    },
    "100100": {
      "卦象": "艮卦",
      "卦辭": [
        "運氣：障礙重重，氣運停滯不前，未能順利進行業務。宜守不宜拓張，避免與人爭執，色情陷阱災害要小心。依賴心強或過份倔強都不利。\n婚姻運：有阻力，不得其門而入或遇上不適合自己的對象。\n求職運：費時又得不到新的職業。\n健康運：病況根深蒂固，較麻煩，需要耐心療養才能恢復，注意動脈硬化及腦部病。\n戀愛運：愛情需要雙方面。",
        "運氣：阻礙重重之象。氣運停滯不振，困難多端，萬事不如意之時運也。這個時候應當潔身自好以等待時連之解通為上策。同時不能嚐試新的事業，退守舊業可也。還有遇事拖延之象；不和與爭執象；色情陷阱的災害與不利象；頑固與過份倔強所導致的不利象；依賴心過重所招致的失敗與不利等象。\n婚姻：有阻礙，不得其門而入。或勞苦不和之凶緣也。\n戀愛：單相思的不成功象。\n疾病：病況根深蒂固，不易康復之象，然而耐心療養即有康復希望。所患為結核病，動脈硬化症或腦病等。\n求職：費時而不得要領。\n事業：不得時，等袋為妙，改行為凶。"
      ]
    },
    "100101": {
      "卦象": "賁卦",
      "卦辭": [
        "運氣：卦象顯示以美觀包纏與掩蓋著醜惡。外表美觀而內在空虛，隱憂之時運。必須充實自己，內在美才能通達。要搞好人緣，得人和可增運。防因忽略小處而招致誤了大事之卦象。\n婚姻運：須把對方了解清楚，才訂下婚緣都未遲。\n求職運：條件若不訂得太高，會有工作做。\n健康運：必須彼此互相了解，估計對方太高會失望。\n戀愛運：。",
        "運氣：外表美觀而內在空虛，隱憂之時運也。所以您必須充實自己，然後運氣才能通達，脫離苦海得道吉祥。並且得人和為首要之象，缺乏老謀深算即招致不利與失敗之象。因小處忽略以致於誤大事之象。抱負大但力不從心，蒙受他人誹謗之象也。\n婚姻：須把對方調查清楚。以說話的技巧決定成敗與否了。\n戀愛：能得到成功，但因情況不明，估計對方過高而失望。\n疾病：比外表的虛弱更嚴重。治療上須全力以赴。否則和有生命的危險。所患為腺病，胸部或腹部等的疾病。\n求職：可以謀就。但條件放得過高時必敗。\n事業：知己知彼，量力而行即吉。"
      ]
    },
    "100110": {
      "卦象": "蠱卦",
      "卦辭": [
        "運氣：事業停滯不前，暫難改變現狀，需要以最大勇氣，膽大細心加以革新才能推動運氣轉運，同時有內憂之患，家務紊亂，有桃色糾紛。\n婚姻運：多障礙，多艱苦，最緊要，不是良緣放棄求他緣。\n求職運：改變方針，另行謀求。\n健康運：可能會動手術或用特殊治療法可改變狀態，並把握治療時機，要全身檢查身體。\n戀愛運：關係複雜，苦惱煩多。宜改變。",
        "運氣：事業停滯不前，暫難改變現狀，需要以最大勇氣，膽大細心加以革新才能推動運氣轉運，同時有內憂之患，家務紊亂，有桃色糾紛。\n婚姻運：多障礙，多艱苦，最緊要，不是良緣放棄求他緣。\n求職運：改變方針，另行謀求。\n健康運：可能會動手術或用特殊治療法可改變狀態，並把握治療時機，要全身檢查身體。\n戀愛運：關係複雜，苦惱煩多。宜改變。"
      ]
    },
    "100111": {
      "卦象": "大畜卦",
      "卦辭": [
        "運氣：運程多阻力，欲展圖而不得志，要經受一番艱難，埋頭苦幹才能成就大事業，要蓄財、要養足精神，充實自己。\n婚姻運：出現障礙，以誠待之終成功。\n求職運：終於可得一份好職位。\n健康運：健康差，要耐心療養，是屬胸腹部的疾病。\n戀愛運：有困難難免，開始不順利，結果是圓滿。",
        "運氣：路途艱苦，欲展鴻圖而不得志。兼守正道，埋頭苦幹即能克服艱難，達成目的，完成大事大業，同時具有蓄財象，得上司的提拔及學習進步等象。\n婚姻：中途有障礙，但以誠待之終究成功，是逐漸發展與幸福之良緣也。\n戀愛：阻礙與困難在所難免，但真誠以赴，必得成功。\n疾病：病情嚴重，拖延時間長。療養得法可得痊癒。所患為胸腹部的疾病。\n求職：謀職費時，但最後所得為一良好之職位。\n事業：可策劃進行，吉也。"
      ]
    },
    "101000": {
      "卦象": "晉卦",
      "卦辭": [
        "運氣：有貴人相助及長輩的提拔。業務繁榮，聲望漸高，宜多做公共事業可揚眉吐氣。\n婚姻運：大吉，得長輩的支持。\n求職運：可得長輩的提拔，可得意外的新環境。\n健康運：有腸胃病及糖尿病，宜求醫治療。\n戀愛運：必成功無疑。",
        "運氣：鼎盛之大好運也。有貴人幫助與擁戴或長輩的提拔而更加開運之象。同時是業務繁榮，聲望漸高；萬事如意；倡導公共事業而揚眉吐氣之象；或宏利，賺大錢；與人共事即吉。然而有時難免形成外表虛張而內在空虛之感。\n婚姻：大吉。得長輩的指示與幫忙而獲不少便利。\n戀愛：成功無疑。\n疾病：不久可痊癒。所患為喝病，腸胃病等。\n求職：得長輩的提拔，可得意外進境。\n事業：大吉。"
      ]
    },
    "101001": {
      "卦象": "嗜嗑卦",
      "卦辭": [
        "運氣：凡事不如意，無法往前推進。必須以強硬，果斷的魄力去解決困難。易與人發生爭執，宜親力親為辦事。防被人中傷。\n婚姻運：最初障礙多，意見不合。以後逐漸融洽。成功與否看自己的努力了。\n求職運：困難多端，以強硬的態度，積極謀求，就能成功。\n健康運：健康較麻煩，要及時治療不拖慢可安。\n戀愛運：有人從中障礙，雖遭拒絕，但專心一意，必會成功。",
        "運氣：凡事不如意，無法往前推進之時運也。您必須以強硬果敢的態度排除萬難，勇往邁進，才能達成目的。同時還有容易與人發告爭執之象，不用他人而親臨其事即吉象；有女禍；蒙受惡言中傷之象等等。\n婚姻：最初阻礙多，意見不合。以後逐漸得到意見一致。成功與否要看稍極推展的程度而定。\n戀愛：有人從中阻礙。最初雖遭拒絕，但以不屈不撓之精神挺身而出，終究可以得到成功。\n疾病：病況嚴重，但斷然下決心動手術或做其他特殊的治療法就能得到痊癒。所患當為惡性腫痬神經痛或喝病等。\n求職：困難多端，惟有強硬的態度，積極謀求，就能成功。\n事業：難免有阻礙，只要積極推行即成功在望。"
      ]
    },
    "101010": {
      "卦象": "未濟卦",
      "卦辭": [
        "運氣：雖屬不能發揮自己得潛質。氣運未通萬事不順乏時運。但以日漸向好的方向改變，運氣漸開，前途已放出光明，應鼓起勇氣，以沉著的態度發奮圖強。\n婚姻運：最初難免發生障礙，未能順利；另拖延時間，唯有耐心等待，終得成功。\n求職運：暫無希望，但不要灰心，耐心與努力會得到意外的好職位。\n健康運：要留意腹部及血液循環系統疾病，小心去療養，才可安。\n戀愛運：當初較反覆，逐漸受誠心與耐心改變而得成功。",
        "運氣：雖屬不能發揮自己得潛質。氣運未通萬事不順乏時運。但以日漸向好的方向改變，運氣漸開，前途已放出光明，應鼓起勇氣，以沉著的態度發奮圖強。\n婚姻運：最初難免發生障礙，未能順利；另拖延時間，唯有耐心等待，終得成功。\n求職運：暫無希望，但不要灰心，耐心與努力會得到意外的好職位。\n健康運：要留意腹部及血液循環系統疾病，小心去療養，才可安。\n戀愛運：當初較反覆，逐漸受誠心與耐心改變而得成功。"
      ]
    },
    "101011": {
      "卦象": "睽卦",
      "卦辭": [
        "運氣：水火不相容之象，氣運不通，諸事不如意。不能衝動挺身急進，宜守本分，以溫和態度處事，可安泰，不利與人合作，會多糾紛，要搞好人際關係。\n婚姻運：難成功，性格不合，志趣不相投之凶緣。\n求職運：暫未能求到。\n健康運：重症。防醫生診斷錯誤，要注意，所患的為內臟機能障礙。\n戀愛運：暫不成功，等待新機會之象。",
        "運氣：水火不相容之象也。氣運不通，諸事齟齬不如意。此時切忌挺身急進，確守本份，以溫和的態度做家運安泰之努力，方可轉危為安。同時還有與人發生糾紛，家庭不和與勞碌；估計錯誤與至交者發生意見上的衝突，以致於疏遠或絕交等象。\n婚姻：不成功。性格不和，志趣下相投之凶緣。遺有生離死別之受。\n戀愛：不成功。\n疾病：重症之危險象。可能發生醫生診斷的錯誤所引起的不幸。所患為內臟機能的障礙象。\n求職：無望。\n事業：凶。希望與計畫違背之象。"
      ]
    },
    "101100": {
      "卦象": "旅卦",
      "卦辭": [
        "運氣：此卦象顯示旅行。運程缺乏安定，身世飄浮不定，還不能落地生根。離開如意，需一段時間，而且要潔身自愛，意志堅定。對業務上居住環境發生變動，無援，要自身艱苦應付。\n婚姻運：多勞苦與不穩定，難求。\n求職運：缺乏有力人士之協助，暫無望。\n健康運：痛況起伏不定，急需要入院治療。所患之疾是呼吸系統及消化系統。\n戀愛運：對方意志不堅定，以致失敗。",
        "運氣：此卦顯示旅行之象。所似占到此卦表示恰似在旅程上一樣運氣缺乏安定，身世飄搖不定，萬事不如意。此時您應該堅定意志，潔身自守以為安定運氣之計為迫切之需。一方面還有業務上發生阻礙；孤獨無援；居住發生變動與障礙；骨肉無情及家內發生糾紛；旅途上發生障礙與火災等象。\n婚姻：多勞苦與不穩定之凶緣也。又是成為拉鋸戰而得不到結果。\n戀愛：對方意志不堅定，以致失敗。\n疾病：病況起伏不定與拖延時間。有生命之虞。所患當為呼吸器病或消化器病等。\n求職：缺乏有力人士的奔走，因此白費心思。暫時無望。\n事業：凶，須等待時機。"
      ]
    },
    "101101": {
      "卦象": "離卦",
      "卦辭": [
        "運氣：能符合於正道可得其所。需謙虛，和順，尊重他人意見，與他人認真合作可成功。性急妄動、短見與意氣用事則失敗。\n婚姻運：屬良緣。要經朋友或有地位者介紹做媒人，保持聯繫會成功。\n求職運：信賴長輩，會有一份很有希望職位。\n健康運：易患腹部及糖尿病，較麻煩，但經治療可痊癒。\n戀愛運：性急，衝動即有失敗之虞。",
        "運氣：能符合於正道可得其所。需謙虛，和順，尊重他人意見，與他人認真合作可成功。性急妄動、短見與意氣用事則失敗。\n婚姻運：屬良緣。要經朋友或有地位者介紹做媒人，保持聯繫會成功。\n求職運：信賴長輩，會有一份很有希望職位。\n健康運：易患腹部及糖尿病，較麻煩，但經治療可痊癒。\n戀愛運：性急，衝動即有失敗之虞。"
      ]
    },
    "101110": {
      "卦象": "鼎卦",
      "卦辭": [
        "運氣：占得此卦表示氣運亨通，萬事通達吉祥。易得上司的提拔，以發揮自己的才智而平步青雲之象。交友要小心。宜致力公共事業貨做公務員可名利雙收。\n婚姻運：屬良緣，必然成功。\n求職運：可順利。\n健康運：很快會痊癒，所患的為消化器官疾病。\n戀愛運：可成功無疑。",
        "運氣：隆重的儀式或盛典往往用到鼎。古時候的聖賢均以「鼎卦」的性情以解說治天下之道。所以占到此卦即表示氣運亨通，萬事通達，得吉祥之時運也。且有得上司的提拔以發揮自己才智而平步青雲之象。留心與不善之徒的親近，否則導致災害。一方面顯示解疑惑與困難，得事物之穩定象。致力於公共事業或做一個公務員則名利雙收之象。\n婚姻：幸福繁榮之良緣也。必然成功。\n戀愛：成功無疑。\n疾病：很快就會痊癒。所患為喝病或消化器病。\n求職：順利。\n事業：可策劃進行，大吉也。"
      ]
    },
    "101111": {
      "卦象": "大有卦",
      "卦辭": [
        "運氣：氣運亨通隆昌；財運好。宜謹慎步伐與處世態度。\n婚姻運：良緣必然可撮合。\n求職運：順利，可有一份安定工作，可得良好地位。\n健康運：已經過危險時期，仍要注意。所患的病為發高燒、肺呼吸系統。\n戀愛運：可成功不成問題。",
        "運氣：氣運亨通隆昌得其時也。但難免隱藏蓄盛極必衰的預兆，不能不謹慎自己的步伐與處事的態度，以確保盛運的繼續開展。還有眾望所歸與走紅運賺大錢之象。\n婚姻：良緣必然撮合。有與家庭富有的上司可能聯婚之象。\n戀愛：成功是不成問題的，然而不能太驕傲，否則導致破裂。\n疾病：已經渡過危險時期，到了快痊癒的時候。然不能怠慢治療。所患當為發高燒的疾病，肺部或腹部的疾病等等。\n求職：順利，將來可得良好地位。\n事業：可順利。"
      ]
    },
    "110000": {
      "卦象": "觀卦",
      "卦辭": [
        "運氣：此卦顯示盛極必衰，必須以至誠待人，才能倖免於難，而確保安泰；亦表人生旅途多起跌。\n婚姻運：較多困難，以誠心全力以赴。可得長輩之助而有希望。\n求職運：不易謀就，較多困難，等時機。\n健康運：無礙，但不可大意，注意飲食，所患的是腸胃病或是泌尿器病。\n戀愛運：成就可喜之象。",
        "運氣：盛極必衰，面臨危險之時運，必須以至誠待人，才能倖免於難，而確保安泰與宏運，福利雙收。依賴高貴長輩者的提拔而得上進之象。重振聲威之象。外表好看而內在空虛之象。\n婚姻：諸多困難，難望成功，然而至誠與全力以赴，同時得到長輩的幫忙即有成功希望，緣份雖屬不錯，然而難免波折太多。\n戀愛：可能有暫時的成功。但持續不了。尤其對方可能變心。\n疾病：病況一度好轉，但以後更惡化而危險。然而用心治療即非絕望也。所患為飲食造成的疾病，胸部的疾病等。\n求職：無望。暫時找一棲身之所，以後再等待時機轉移陣地。\n事業：暫時停止策劃，等待時機為安。"
      ]
    },
    "110001": {
      "卦象": "益卦",
      "卦辭": [
        "運氣：運氣亨通，可完成大事大業之時，必須有決斷、勇往直前。猶豫不決，停止部前獲得意忘形會轉衰。與人合作好。\n婚姻運：和好繁榮之大吉緣，成功。\n求職運：得到意外的好職位。\n健康運：可痊癒，但要十分小心療養，所患為胃擴張、咽喉疾病等。\n戀愛運：互相體貼，必然成功。",
        "運氣：運氣亨通，完成大事大業之時也。然須有決斷，勇往邁進。切勿猶豫不決。然不可得意忘形，過份鬆懈及導致破運。同時還有家庭繁榮，金錢運亨通，願望與計劃之成就，與人共事即吉，有貴人協助，家庭有喜事等象。\n婚姻：和好繁榮之大吉緣。成功無疑。\n戀愛：相互體貼之象。必然成功。\n疾病：可得痊癒。但要十分小心療養。所患為胃擴張，性病或咽喉的疾病等。\n求職：得到意料之外的好職位。\n事業：積極展開均吉利也。"
      ]
    },
    "110010": {
      "卦象": "渙卦",
      "卦辭": [
        "運氣：運氣解通。屬艱難困苦消之喜悅運也。易得貴人助，然不可大意，任性會導致失敗。要膽大心細，動作敏捷才能獲得好成績。利出於外、旅遊業。\n婚姻運：障礙解消可獲成功。\n求職運：如意，可得到一份職業。\n健康運：注意血液循環系統的疾病及呼吸系統，要及時治療，無大問題。\n戀愛運：最初的是考驗期，能堅持可獲成功。",
        "運氣：氣運解通，艱難困苦解消之喜悅運也。然不可太大意，任性放縱即招致失敗與不利。凡處理事物要膽大心細，動作要敏捷才能得利；從事於運輸業可得名利雙收之效；時有出外旅行之象，尤其是坐船旅行。得他人的協助而擺脫艱難之象。\n婚姻：阻礙解消而獲成功。又最初難免勞苦，但將來必得幸福之良緣也。\n戀愛：最初難免有所阻礙，唯有以不屈不撓之精神推進之即終獲成功。\n疾病：病況雖有一時的危險，但終獲痊癒。所患為血液循環系統的疾病，呼吸器病等。\n求職：如意。\n事業：順利。"
      ]
    },
    "110011": {
      "卦象": "中孚卦",
      "卦辭": [
        "運氣：誠心誠意去推動一切，即待他人之信賴，運氣可逐漸開展。與人和睦相處，對人講究信義。小心擇友和要認清善惡。\n婚姻運：和好繁榮之良緣。\n求職運：一切順利。\n健康運：療養、調理身體可痊癒，胃擴張腹膜炎或腎虛。\n戀愛運：相互關懷可溫馨。",
        "運氣：誠心誠意去推動一切即得他人之信賴而運氣逐漸開展之象，如有邪念或忽略了信用及導致破運，蒙受災害與不利。對人講究信義即得吉報；與人共事者得人和即吉利；認清善惡而友之即吉利；同時還有經常必要外出旅行之象。\n婚姻：和好繁榮之良緣也。\n戀愛：以誠懇達成目的。\n疾病：療養得法而得痊癒。所患為胃擴張。\n求職：順利。\n事業：可策劃進行，但避免勉強行事。"
      ]
    },
    "110100": {
      "卦象": "漸卦",
      "卦辭": [
        "運氣：前途充滿光明。萬事轉為順暢，逐漸開運。亦把握時機發奮。但亦表示性急即敗，漸進即利，積小成多，女性占得此卦，表有喜事。\n婚姻運：逐漸邁向幸福的康莊大道，不要急。\n求職運：有機會，可求得好職業。\n健康運：要防五官毛病及腸胃病，不要因小病而忽略。\n戀愛運：冷靜面對，可獲成功。",
        "運氣：逐漸開運，萬事轉為順利，前途充滿了光明與希望之時運也。這時候必須把握住有利機會努力奮鬥以為發展昌隆之計。性急即敗，漸進即利；積少成多，諸事雖暫時無望，但畢竟能獲得成功之象，尤其婦女占到此卦必有喜事也。\n婚姻：逐漸邁向幸福的康莊大道。不要性急。按部就班地推展。\n戀愛：冷靜對付，可獲成功。\n疾病：治療費時，但只要用心療養勢必痊癒。所患為耳朵與鼻子的疾病或腸胃病等。\n求職：頗費時日，但最後可得良好之職位。\n事業：可策劃進行，吉。但切勿勉強才是。"
      ]
    },
    "110101": {
      "卦象": "家人卦",
      "卦辭": [
        "運氣：此卦表長幼有序，陰陽相扶持，一家安樂相處。運氣安泰。堅守自己岡位去努力，不能見異思遷想往他處或衝動放棄而去。\n婚姻運：合好幸福之大吉緣。\n求職運：一切順利，能有正常的收入。\n健康運：腹部毛病，問題不大。\n戀愛運：可如意。",
        "運氣：長幼有序，陰陽相扶助，一家人樂融融相處，家道平安，運氣安泰之吉祥幸福運也。務須本著自己的崗位努力做去。不能移心他往或衝動最為重要。同時是喜氣洋溢之大好運也。\n婚姻：和好幸福之大吉緣。\n戀愛：可成功無疑。\n疾病：病況沒有什麼了不起，不久可痊癒。所患為下腹部的疾病。\n求職：順利。\n事業：維持現狀為吉，不宜改變。"
      ]
    },
    "110110": {
      "卦象": "巽卦",
      "卦辭": [
        "運氣：表示運氣多波瀾，流離不定之運勢。必須堅定意志，對人採取恭順態度，隨機應變。迅速果斷，把握時機。但記過分衝動。\n婚姻運：是良緣，但初多磨，有誠意可如願。\n求職運：不大理想。暫時安定下來。\n健康運：雖無生命危險，但屬頑病。若需要手術，大膽去面對。\n戀愛運：不要盲目，冷靜果斷的態度去面對，其結果是好的。",
        "運氣：巽卦代表風。風的流動是無定形的。所以占得此卦即表示多波瀾，流離不定之運努也。這時候您必須堅定您的意志，對事對人均採取恭順的態度與方針，隨機應變，機作進退之明確決定與行動才不致於失敗。這樣一來才能獲得意外之收穫。\n婚姻：多少有波瀾，但大體上而言是良緣也。\n戀愛：不要盲目，以冷靜果斷的態度應付即可成功無疑。\n疾病：病況變化無窮，患病時間長。病勢頑固，但沒脊生命的危險。所患為性病，糖尿病或神經痛等。\n求職：請地方上有力人士的幫忙與介紹，雖然費時間多，但畢竟獲得結果，但並不理想。\n事業：不要性急，不用勉強。均可策劃進行。"
      ]
    },
    "110111": {
      "卦象": "小畜卦",
      "卦辭": [
        "運氣：運氣澀滯，障礙多。事事不能如意。但不要悲觀自暴自棄而墮落。忍耐奮鬥以等待有利機會的到來。雲開見月明運氣自然開通。此卦還表示被小人困；成為養子而繼承他家。\n婚姻運：。障礙多，需等待時機行事。\n求職運：暫時未能成功。\n健康運：防小病不及時醫而變成慢性病。注意子宮、腸胃。\n戀愛運：障礙多，不易成功。",
        "運氣：運氣障礙多，萬事不如意之時運也。不要悲觀自暴自棄而墮落，忍耐奮鬥以等待有利機會的到來。因為雲層散開之後就是天晴。意即氣運自然開通的時候將來到。因小人的阻止而前進困難憂悶象；成為養子而繼承他家；夫婦不和象與女禍等象。\n婚姻：不和睦之凶緣也，阻礙多，須等待時機行事。\n戀愛：障礙多，不易成功。假定成功也必然以悲劇收場。\n疾病：患病時間長，可能變為慢性病。所患為性病，子宮或胸部的疾病，腸胃病等。\n求職：暫時無望。\n事業：不如意，宜暫等時機為妙。"
      ]
    },
    "111000": {
      "卦象": "否卦",
      "卦辭": [
        "運氣：氣運不通，辛勞困難多。多糾紛，有阻力，但不宜悲觀失望，應鼓起勇氣面對困難，努力向前，退守吉。屬先苦後甜的運。\n婚姻運：不和，需戶箱諒解平靜。\n求職運：等待機會。\n健康運：小心耳鼻疾病、呼吸器病、腦病、宜預早全身健康檢查。\n戀愛運：被拒於外。",
        "運氣：氣運不通，辛勞與困難多。萬事不如意。本身窮苦潦倒且糾紛多。有小人或不善者的加害與損失，也有別離之苦。然而用不著失意或悲觀，因為世界上盛衰循環是自然的道理。所以必須拿出您的勇氣，努力奮鬥，耐心等待開運和一切如意的時機到來。此刻不要性急，退守即得吉也。\n婚姻：不和與離別之象。不能成功也。\n戀愛：被拒於外之象也。\n疾病：嚴重而康復無望。所患為耳鼻的疾病，呼吸器病，腦病或癌症等。\n求職：沒有希望，要等待機會。\n事業：不得時機。實現無望。請終止這種念頭。"
      ]
    },
    "111001": {
      "卦象": "無妄卦",
      "卦辭": [
        "運氣：退守即吉，急取則敗。小心有意外事發，不能自私，醉心個人利益，慾望太高。待人宜誠懇。\n婚姻運：光明磊落，至誠待之即成功。夫婦間以真誠相待，必能幸福。\n求職運：誠心誠意求之必順利。\n健康運：身體有病，需早日求醫可安。注意呼吸器官病，神經性的疾病。\n戀愛運：成功與否，全靠彼此真誠相處程度。",
        "運氣：以至誠待人與處世為宗旨，順乎自然的道理，作為自己進退的依據。千萬不能醉心於個人的利益與滿足本身的慾望，否則必招致意外災害與厄運，而陷於辛勞困苦之深淵。同時暗示：退守即吉，急進即凶。並且遺有意外遭遇之象。\n婚姻：光明磊落，至誠待之即成功無疑。夫婦之間以真誠相待必能獲得永久之幸福。\n戀愛：成功與否全靠彼此真誠相處的程度而定。\n疾病：療養得法即可痊癒，患者不自愛而與養生之道背道而馳即導致不幸。所患為吸氣病，神經性的疾病等等。\n求職：誠心誠意求之必應。\n事業：不要勉強。順乎自然推進即吉也。"
      ]
    },
    "111010": {
      "卦象": "訟卦",
      "卦辭": [
        "運氣：運氣閉塞不通。凡事易招人指責多障礙。不宜勉強求進，宜守為吉等時機，凡事要瞭解清楚才下決定，以免出錯。\n婚姻運：不吉利，不能成事。\n求職運：還不能順利。\n健康運：病況不輕，易患腦部、肺部或血液循環病。\n戀愛運：對方不夠誠意。",
        "運氣：氣運閉塞不通，凡事招致齟齬與障礙，不如意之時運也。不宜挺進，宜退守以等待時運之解通。與人發生爭執即不利，雖是理想直勢必陷於是非。雖有智謀深算也必然招致不利之惡果。同時是估計錯誤，而易中對方奸計，招來禍害不利之象。\n婚姻：不吉利。不成功也。\n戀愛：對方不夠誠意，終究失敗。\n疾病：病勢的變化劇烈，病況嚴重。盡最大努力加以治療外，別無他法。所患為腦部、肺部、腎臟或血液循環系統之疾病。\n求職：不成功。\n事業：凶也。不可以進行。"
      ]
    },
    "111011": {
      "卦象": "履卦",
      "卦辭": [
        "運氣：處於困難危險的環境中，應以柔順態度應付，可得平安之象。耐心等待時機來到，退守為吉。\n婚姻運：雖是良緣，有阻力難成全其美，以禮待人可望成功。\n求職運：暫難找到，利用時間學習。\n健康運：防腦部或肺病，不可忽略及時求醫。\n戀愛運：以真誠態度才有成功的希望。",
        "運氣：正處於困難危險的環境中，只要能以和藹柔順的態度應付就得平安之象也。並且以謙遜自重，耐心等待有利機運的到來就得吉象。積極往前推進即不利，退守即吉。\n婚姻：雖是良緣，但障礙多，很難成全其美。然而以禮待之並且有恆地週旋下去，或有成功希望。\n戀愛：歷盡艱辛萬難，只要一本初衷以謙遜的態度繼續努力或有成功的希望。\n疾病：病勢嚴重而危險，但只要盡人事以療養必得康復與確保長壽。所患為腦病或肺病等。\n求職：無法馬上找到，要耐心等待時運。\n事業：阻礙多，實行困難之象。暫等時機為妙。"
      ]
    },
    "111100": {
      "卦象": "遯卦",
      "卦辭": [
        "運氣：衰運的預兆，凡事以退守為吉。言行小心處事謹慎，可得安泰。交友要小心，否則蒙受牽連受害，遠離是非圈，此卦為小人得勢，而君子退隱。\n婚姻運：會有變化。同床異夢。\n求職運：須待時日，利用時間多充實自己。\n健康運：防胸部、腹部及骨髓。病向淺中醫，可防變化。\n戀愛運：不成功。",
        "運氣：衰運的預兆，萬事宜採取退守之方針，言行嚴謹處事謹慎，以為獲得安泰運之計。還有家運不振象，隱居之象。晚輩牽累與蒙受災害象。為小人陷害象。理直而陷於是非之地等象。宜識時務以引退之象。\n婚姻：無法談攏。或別離之破緣。\n戀愛：落花有意，流水無情。不成功。\n疾病：病勢嚴重之危險象。盡人事以療養吧！所患為胸部，腹部或骨髓等疾病。\n就業：無望。須待時日。\n事業：不得時，須等待時機。"
      ]
    },
    "111101": {
      "卦象": "同人卦",
      "卦辭": [
        "運氣：平安，吉祥萬事如意之時運。可與人合作經營事業。宜廣結善緣，得人和而開拓事業大好機會。占得此卦者辦事宜公正，否則招災。避免與人發生爭執。\n婚姻運：好的良緣。\n求職運：可得到，順利。\n健康運：防糖尿、呼吸器病。無大礙可痊癒。\n戀愛運：兩相思，必成功。",
        "運氣：平安吉祥，萬事如意之時運，與人共同經營事業均可成功。宜廣結人緣，得人和而開拓大好機運之象。揚眉吐氣，興家立業之象。然而不能因此而我行我素，偏私而失去公正的立場，否則必招致無謂的災害。\n婚姻：彼此和好之良緣也。\n戀愛：倆相思，必然成功。\n疾病：不必掛意，不久可痊癒。所患為喝病、呼吸器病。\n事業：可推展，吉也。"
      ]
    },
    "111110": {
      "卦象": "姤卦",
      "卦辭": [
        "運氣：占到此卦處事應謹慎，以防逆運來時可安泰度過。此卦意表示防被人欺詐。要注意理財。\n婚姻運：障礙多，不宜急於結婚，再考慮一段時間。\n求職運：不成功，需努力。\n健康運：對自己的病須充分留心療養。注意痔瘡及呼吸系統。\n戀愛運：諸多障礙，終致失敗。",
        "運氣：此卦中忽然來了一個陰爻在最下方，開始萌芽與生長而消滅前五陽爻的原氣。暗示宏運中衰，辛勞困苦迫近眉睫之時運來臨。此時應萬事謹慎以防衰運之開始而獲安泰。同時還有意外的災難，如被屬下或奸詐邪惡者的陷害，或女禍，失敗等。\n婚姻：阻礙多，徒勞無功之凶緣也。須重新考慮，同時顯示意外的障礙多而不成功之象。\n戀愛：諸多障礙，終致失敗。\n疾病：病況繼續惡化，須充分留心療養。所患為性病，肺結核或痔等疾病。\n求職：不成功。\n事業：凶。有意想不到的阻礙而不能實現。"
      ]
    },
    "111111": {
      "卦象": "乾卦",
      "卦辭": [
        "運氣：表示吉祥，萬事如意，名利雙收，身體強健，但不可我行我素，得意忘形，會招致失敗。\n婚姻運：成全其美、吉祥。女性理想過高，很難成婚或失敗。男性如遇到虛榮心強的又傲氣的對象，即易受困。\n求職運：有上司提拔，即有一番作為。\n健康運：注意健康，有病者療養得法無大礙，可痊癒。小心頭部、胸部。\n戀愛運：可能成功，但彼此自私可招失敗。",
        "運氣：萬事如意，旺盛，名利雙收，地位躍升與家業安榮之吉象也。然而得意忘形，過份驕傲即盛運為之破壞而招致失敗，故不能不謹慎其身。此卦尚有功名榮達，名門富貴，賢明叡智與得揚名榮達的子孫等的吉象。代表強健與首長之象。但我行我素必然導致失敗。婦女占到此卦即表示唯我獨尊的驕傲之象。\n婚姻：成全其美的吉象。然而婦女即往往好高騖遠，理想過高以致於遲遲未能成功或終至失敗。男人如遇到虛榮心強而驕傲的女孩子即容易受困，因此必須提高警覺才是。\n戀愛：可能成功，彼此自私即可能招致破裂。\n疾病：相當嚴重，但因先天的體質好，只要療養得法即可痊癒無疑。所患為胸部或頭部的疾病。\n求職：有上司的提拔即有一番作為。將來定有相當成就。\n事業：營業得天時之吉象，故宜維持現狀較佳"
      ]
    }
  },
  "五行": {},
  "上下卦": {}
}